zarinpal_error_codes = {
    "-9": """
            خطای اعتبار سنجی
        1- مرچنت کد داخل تنظیمات وارد نشده باشد
        -2 آدرس بازگشت (callbackurl) وارد نشده باشد
        -3 توضیحات (description ) وارد نشده باشد و یا از حد مجاز 500 کارکتر بیشتر باشد
        -4 مبلغ پرداختی کمتر یا بیشتر از حد مجاز
    """,
    "-10": "ای پی یا مرچنت كد پذیرنده صحیح نیست.",
    "-11": "مرچنت کد فعال نیست، پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد.",
    "-12": "از دفعات مجاز در یک بازه زمانی کوتاه به امور مشتریان زرین پال اطلاع دهید",
    "-13": "خطای مربوط به محدودیت تراکنش. برای رفع این مورد نسبت به تکمیل مدارک خود با مراجعه به پشتیبانی اقدام نمایید.",
    "-14": "کال‌بک URL با دامنه ثبت شده درگاه مغایرت دارد.",
    "-15": "درگاه پرداخت به حالت تعلیق در آمده است، پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد",
    "-16": "سطح تایید پذیرنده پایین تر از سطح نقره ای است",
    "-17": "محدودیت پذیرنده در سطح آبی",
    "-18": "امکان استفاده از کد درگاه اختصاصی خود بر روی سایت یا جای دیگری را ندارید",
    "-19": "امکان ایجاد تراکنش برای این ترمینال امکان پذیر نیست",
    "100": "عملیات موفق",
    "-30": "پذیرنده اجازه دسترسی به سرویس تسویه اشتراکی شناور را ندارد",
    "-31": "حساب بانکی تسویه را به پنل اضافه کنید. مقادیر وارد شده برای تسهیم درست نیست",
    "-32": "مبلغ وارد شده از مبلغ کل تراکنش بیشتر است",
    "-33": "درصدهای وارد شده صحیح نیست",
    "-34": "مبلغ وارد شده از مبلغ کل تراکنش بیشتر است",
    "-35": "تعداد افراد دریافت کننده تسهیم بیش از حد مجاز است",
    "-36": "حداقل مبلغ جهت تسهیم باید ۱۰۰۰۰ ریال باشد",
    "-37": "یک یا چند شماره شبای وارد شده برای تسهیم از سمت بانک غیر فعال است",
    "-38": "خطا، عدم تعریف صحیح شبا، لطفا دقایقی دیگر تلاش کنید",
    "-39": "خطایی رخ داده است به امور مشتریان زرین پال اطلاع دهید",
    "-40": "ارسالی های نامعبر",
    "-41": "حداکثر مبلغ پرداختی ۱۰۰ میلیون تومان است",
    "-50": "مبلغ پرداخت شده با مقدار مبلغ ارسالی در متد وریفای متفاوت است",
    "-51": "پرداخت ناموفق",
    "-52": "خطای غیر منتظره‌ای رخ داده است. پذیرنده مشکل خود را به امور مشتریان زرین‌پال ارجاع دهد",
    "-53": "پرداخت متعلق به این مرچنت کد نیست",
    "-54": "اتوریتی نامعتبر است",
    "-55": "تراکنش مورد نظر یافت نشد",
    "-60": "امکان ریورس کردن تراکنش با بانک وجود ندارد",
    "-61": "تراکنش موفق نیست یا قبلا ریورس شده است",
    "-62": "آی پی درگاه ست نشده است",
    "-63": "حداکثر زمان (۳۰ دقیقه) برای ریورس کردن این تراکنش منقضی شده است",
    "101": "تراکنش وریفای شده است."
}